Tekla Open API Reference for Tekla Structures 2025
ProjectInfo.GetBasePoints Method
 Gets all available base points as a list.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static List<BasePoint> GetBasePoints()
Public Shared Function GetBasePoints As List(Of BasePoint)
Return Value
Type: List<BasePoint>
The list of available base points.
See Also
Reference
ProjectInfo Class
Tekla.Structures.Model Namespace